<!-- dflook/terraform-github-actions {"workspace":"kub1k","backend_type":"local","backend":"e708c760ade2fcee70b45d54b480c4402f85ea2184d8298b0d41181437e1e140","plan_job_ref":"Job Terraform Plan #97 at https://github.com/ironashram/kub1k/actions/runs/11868150396","plan_out_hash":"e274f20732ebb2d754a89333233dc4cf2e85b01369e020c7d9c23532a77842d2","plan_hash":"68d8494b34064ac35356a79ae7b655b5d418e70d993de70acc9aa8b41615eefa","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform__ in the __kub1k__ workspace
<details>
<summary>Plan: 1 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.provision_apps[0].helm_release.argocd will be updated in-place
!~  resource "helm_release" "argocd" {
        id                         = "argocd"
        name                       = "argocd"
!~      version                    = "7.7.0" -> "7.7.3"
#        (27 unchanged attributes hidden)

#        (5 unchanged blocks hidden)
    }

  # module.provision_k3s.data.local_sensitive_file.kubeconfig will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "local_sensitive_file" "kubeconfig" {
+       content              = (sensitive value)
+       content_base64       = (sensitive value)
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       filename             = "/github/home/.kube/config-files/kub1k.yaml"
+       id                   = (known after apply)
    }

  # module.provision_k3s.null_resource.k3s_kubeconfig must be replaced
-/+ resource "null_resource" "k3s_kubeconfig" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "timestamp" = "2024-11-09T08:11:47Z" -> (known after apply)
        }
    }

  # module.provision_k3s.vault_kv_secret_v2.k3s will be updated in-place
!~  resource "vault_kv_secret_v2" "k3s" {
!~      data_json           = (sensitive value)
        id                  = "kv/data/kub1k/k3s"
        name                = "kub1k/k3s"
#        (6 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #97](https://github.com/ironashram/kub1k/actions/runs/11868150396)